# ConvertLights Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ConvertLights Property
NavisworksExportOptions Class See Also
---
True to convert lights, false otherwise. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool ConvertLights { get; set; }
```

Visual Basic
---
```text
Public Property ConvertLights As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ConvertLights {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace